; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	thermograph1 - mode
	image0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 183)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 162)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star2)
	(supports instrument6 image0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 164)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 136)
	(= (data Planet3 thermograph1) 153)
	(= (data Planet4 thermograph1) 295)
	(= (data Phenomenon5 thermograph1) 173)
	(= (data Planet6 thermograph1) 175)
	(= (data Star7 thermograph1) 25)
	(= (data Planet3 image0) 103)
	(= (data Planet4 image0) 221)
	(= (data Phenomenon5 image0) 180)
	(= (data Planet6 image0) 135)
	(= (data Star7 image0) 191)
	(= (data Planet3 spectrograph2) 5)
	(= (data Planet4 spectrograph2) 268)
	(= (data Phenomenon5 spectrograph2) 63)
	(= (data Planet6 spectrograph2) 223)
	(= (data Star7 spectrograph2) 170)
	(= (slew_time GroundStation1 Star0) 50.46)
	(= (slew_time Star0 GroundStation1) 50.46)
	(= (slew_time Star2 Star0) 56.96)
	(= (slew_time Star0 Star2) 56.96)
	(= (slew_time Star2 GroundStation1) 47.14)
	(= (slew_time GroundStation1 Star2) 47.14)
	(= (slew_time Planet3 Star0) 5.106)
	(= (slew_time Star0 Planet3) 5.106)
	(= (slew_time Planet3 GroundStation1) 72.51)
	(= (slew_time GroundStation1 Planet3) 72.51)
	(= (slew_time Planet3 Star2) 57.22)
	(= (slew_time Star2 Planet3) 57.22)
	(= (slew_time Planet4 Star0) 10.23)
	(= (slew_time Star0 Planet4) 10.23)
	(= (slew_time Planet4 GroundStation1) 72.35)
	(= (slew_time GroundStation1 Planet4) 72.35)
	(= (slew_time Planet4 Star2) 10.91)
	(= (slew_time Star2 Planet4) 10.91)
	(= (slew_time Planet4 Planet3) 41.76)
	(= (slew_time Planet3 Planet4) 41.76)
	(= (slew_time Phenomenon5 Star0) 27.95)
	(= (slew_time Star0 Phenomenon5) 27.95)
	(= (slew_time Phenomenon5 GroundStation1) 42.66)
	(= (slew_time GroundStation1 Phenomenon5) 42.66)
	(= (slew_time Phenomenon5 Star2) 54.41)
	(= (slew_time Star2 Phenomenon5) 54.41)
	(= (slew_time Phenomenon5 Planet3) 17.68)
	(= (slew_time Planet3 Phenomenon5) 17.68)
	(= (slew_time Phenomenon5 Planet4) 15.07)
	(= (slew_time Planet4 Phenomenon5) 15.07)
	(= (slew_time Planet6 Star0) 62.79)
	(= (slew_time Star0 Planet6) 62.79)
	(= (slew_time Planet6 GroundStation1) 21.01)
	(= (slew_time GroundStation1 Planet6) 21.01)
	(= (slew_time Planet6 Star2) 25.18)
	(= (slew_time Star2 Planet6) 25.18)
	(= (slew_time Planet6 Planet3) 68.5)
	(= (slew_time Planet3 Planet6) 68.5)
	(= (slew_time Planet6 Planet4) 42.05)
	(= (slew_time Planet4 Planet6) 42.05)
	(= (slew_time Planet6 Phenomenon5) 34.03)
	(= (slew_time Phenomenon5 Planet6) 34.03)
	(= (slew_time Star7 Star0) 2.036)
	(= (slew_time Star0 Star7) 2.036)
	(= (slew_time Star7 GroundStation1) 69.22)
	(= (slew_time GroundStation1 Star7) 69.22)
	(= (slew_time Star7 Star2) 8.584)
	(= (slew_time Star2 Star7) 8.584)
	(= (slew_time Star7 Planet3) 29.91)
	(= (slew_time Planet3 Star7) 29.91)
	(= (slew_time Star7 Planet4) 17.46)
	(= (slew_time Planet4 Star7) 17.46)
	(= (slew_time Star7 Phenomenon5) 89.15)
	(= (slew_time Phenomenon5 Star7) 89.15)
	(= (slew_time Star7 Planet6) 35.25)
	(= (slew_time Planet6 Star7) 35.25)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite1 Planet6)
	(have_image Planet3 image0)
	(have_image Planet4 thermograph1)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 image0)
	(have_image Star7 spectrograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 phenomenon5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 183 to 148.97, (fuel-used) from 0 to 34.03
   goals met: 1 of 7
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 7
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 7
4. (turn_to satellite2 star2 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 164 to 138.82, (fuel-used) from 34.03 to 59.21
   goals met: 1 of 7
5. (turn_to satellite1 planet6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 162 to 136.82, (fuel-used) from 59.21 to 84.39
   goals met: 2 of 7
6. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 2 of 7
7. (switch_off instrument6 satellite2)
   deleted: (power_on instrument6)
   added: (power_avail satellite2)
   goals met: 2 of 7
8. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 2 of 7
9. (calibrate satellite2 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 2 of 7
10. (turn_to satellite2 phenomenon5 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 138.82 to 84.41, (fuel-used) from 84.39 to 138.8
   goals met: 2 of 7
11. (take_image satellite2 phenomenon5 instrument5 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 827, (data-stored) from 0 to 173
   goals met: 3 of 7
12. (turn_to satellite2 planet3 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet3)
   changed: (fuel satellite2) from 84.41 to 66.73, (fuel-used) from 138.8 to 156.48
   goals met: 3 of 7
13. (turn_to satellite0 planet4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 148.97 to 133.9, (fuel-used) from 156.48 to 171.55
   goals met: 2 of 7
14. (turn_to satellite1 star7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 136.82 to 101.57, (fuel-used) from 171.55 to 206.8
   goals met: 1 of 7
15. (turn_to satellite0 phenomenon5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 133.9 to 118.83, (fuel-used) from 206.8 to 221.87
   goals met: 2 of 7
16. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 7
17. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 7
18. (turn_to satellite1 star2 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 101.57 to 92.986, (fuel-used) from 221.87 to 230.454
   goals met: 2 of 7
19. (turn_to satellite2 star0 planet3)
   deleted: (pointing satellite2 planet3)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 66.73 to 61.624, (fuel-used) from 230.454 to 235.56
   goals met: 2 of 7
20. (turn_to satellite2 planet4 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet4)
   changed: (fuel satellite2) from 61.624 to 51.394, (fuel-used) from 235.56 to 245.79
   goals met: 2 of 7
21. (take_image satellite2 planet4 instrument5 thermograph1)
   added: (have_image planet4 thermograph1)
   changed: (data_capacity satellite2) from 827 to 532, (data-stored) from 173 to 468
   goals met: 3 of 7
22. (turn_to satellite2 star0 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 51.394 to 41.164, (fuel-used) from 245.79 to 256.02
   goals met: 3 of 7
23. (turn_to satellite2 star7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 41.164 to 39.128, (fuel-used) from 256.02 to 258.056
   goals met: 3 of 7
24. (turn_to satellite1 planet6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 92.986 to 67.806, (fuel-used) from 258.056 to 283.236
   goals met: 4 of 7
25. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 4 of 7
26. (switch_on instrument6 satellite2)
   deleted: (calibrated instrument6) (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 4 of 7
27. (turn_to satellite2 star2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 39.128 to 30.544, (fuel-used) from 283.236 to 291.82
   goals met: 4 of 7
28. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 4 of 7
29. (turn_to satellite2 planet6 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 30.544 to 5.364, (fuel-used) from 291.82 to 317
   goals met: 4 of 7
30. (turn_to satellite0 planet3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 118.83 to 101.15, (fuel-used) from 317 to 334.68
   goals met: 3 of 7
31. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
32. (turn_to satellite0 star0 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 101.15 to 96.044, (fuel-used) from 334.68 to 339.786
   goals met: 3 of 7
33. (turn_to satellite0 star2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 96.044 to 39.084, (fuel-used) from 339.786 to 396.746
   goals met: 3 of 7
34. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 7
35. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 39.084 to 30.5, (fuel-used) from 396.746 to 405.33
   goals met: 3 of 7
36. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   changed: (data_capacity satellite0) from 1000 to 830, (data-stored) from 468 to 638
   goals met: 4 of 7
37. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 30.5 to 28.464, (fuel-used) from 405.33 to 407.366
   goals met: 4 of 7
38. (turn_to satellite0 planet3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 28.464 to 23.358, (fuel-used) from 407.366 to 412.472
   goals met: 4 of 7
39. (take_image satellite0 planet3 instrument0 image0)
   added: (have_image planet3 image0)
   changed: (data_capacity satellite0) from 830 to 727, (data-stored) from 638 to 741
   goals met: 5 of 7
40. (turn_to satellite0 phenomenon5 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 23.358 to 5.678, (fuel-used) from 412.472 to 430.152
   goals met: 6 of 7
41. (take_image satellite2 planet6 instrument6 image0)
   added: (have_image planet6 image0)
   changed: (data_capacity satellite2) from 532 to 397, (data-stored) from 741 to 876
   goals met: 7 of 7
